src/WebHooks/test/Microsoft.AspNetCore.WebHooks.FunctionalTest/Resources/RequestBodies/Salesforce.BadSecret.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
      <OrganizationId>0123456789ABCDENNN</OrganizationId>
      <ActionId>05h370200108OsUAAU</ActionId>
      <SessionId>0123456789ABCDE!BSGSRAzG9lPxyKRPjJ3.sUQ7y0lp2hfgwX.7rEL5rIQeoYuMfw5qZNrGlNz68OF9na3K5m2amoscF3pdHU5Zep_FhBcAK1RY</SessionId>
      <EnterpriseUrl>https://na31.salesforce.com/services/Soap/c/34.0/0123456789ABCDE</EnterpriseUrl>
      <PartnerUrl>https://na31.salesforce.com/services/Soap/u/34.0/0123456789ABCDE</PartnerUrl>
      <Notification>
        <Id>04l37000000L0E5AAK</Id>
        <sObject xsi:type="sf:Lead1" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
          <sf:Id>0123456789ABCDEEAE</sf:Id>
          <sf:City>Redmond</sf:City>
          <sf:CleanStatus>Pending</sf:CleanStatus>
          <sf:Company>Microsoft</sf:Company>
          <sf:Country>USA</sf:Country>
          <sf:CreatedById>1123456789ABCDEAAW</sf:CreatedById>
          <sf:CreatedDate>2015-08-14T18:27:02.000Z</sf:CreatedDate>
          <sf:Description>Some notes...</sf:Description>
          <sf:FirstName>Henrik</sf:FirstName>
          <sf:Industry>Technology</sf:Industry>
          <sf:IsConverted>false</sf:IsConverted>
          <sf:IsDeleted>false</sf:IsDeleted>
          <sf:IsUnreadByOwner>false</sf:IsUnreadByOwner>
          <sf:LastModifiedById>1123456789ABCDEAAW</sf:LastModifiedById>
          <sf:LastModifiedDate>2015-08-14T18:27:02.000Z</sf:LastModifiedDate>
          <sf:LastName>Nielsen</sf:LastName>
          <sf:LastReferencedDate>2015-08-14T18:27:02.000Z</sf:LastReferencedDate>
          <sf:LastViewedDate>2015-08-14T18:27:02.000Z</sf:LastViewedDate>
          <sf:LeadSource>Web</sf:LeadSource>
          <sf:OwnerId>1123456789ABCDEAAW</sf:OwnerId>
          <sf:PhotoUrl>/services/images/photo/0123456789ABCDEEAE</sf:PhotoUrl>
          <sf:PostalCode>98052</sf:PostalCode>
          <sf:Salutation>Mr.</sf:Salutation>
          <sf:State>WA</sf:State>
          <sf:Status>Open - Not Contacted</sf:Status>
          <sf:Street>One Microsoft Way</sf:Street>
          <sf:SystemModstamp>2015-08-14T18:27:02.000Z</sf:SystemModstamp>
          <sf:Title>Architect</sf:Title>
        </sObject>
      </Notification>
      <Notification>
        <Id>14l37000123L0E5AAK</Id>
        <sObject xsi:type="sf:Lead2" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
          <sf:Id>1123456789ABCDEEAE</sf:Id>
          <sf:City>Redmond</sf:City>
          <sf:CleanStatus>Pending</sf:CleanStatus>
          <sf:Company>Microsoft</sf:Company>
          <sf:Country>USA</sf:Country>
          <sf:CreatedById>1123456789ABCDEAAW</sf:CreatedById>
          <sf:CreatedDate>2015-08-14T18:27:02.000Z</sf:CreatedDate>
          <sf:Description>Some notes...</sf:Description>
          <sf:FirstName>Benjamin</sf:FirstName>
          <sf:Industry>Technology</sf:Industry>
          <sf:IsConverted>false</sf:IsConverted>
          <sf:IsDeleted>false</sf:IsDeleted>
          <sf:IsUnreadByOwner>false</sf:IsUnreadByOwner>
          <sf:LastModifiedById>1123456789ABCDEAAW</sf:LastModifiedById>
          <sf:LastModifiedDate>2015-08-14T18:27:02.000Z</sf:LastModifiedDate>
          <sf:LastName>Nielsen</sf:LastName>
          <sf:LastReferencedDate>2015-08-14T18:27:02.000Z</sf:LastReferencedDate>
          <sf:LastViewedDate>2015-08-14T18:27:02.000Z</sf:LastViewedDate>
          <sf:LeadSource>Web</sf:LeadSource>
          <sf:OwnerId>1123456789ABCDEAAW</sf:OwnerId>
          <sf:PhotoUrl>/services/images/photo/0123456789ABCDEEAE</sf:PhotoUrl>
          <sf:PostalCode>98052</sf:PostalCode>
          <sf:Salutation>Mr.</sf:Salutation>
          <sf:State>WA</sf:State>
          <sf:Status>Open - Not Contacted</sf:Status>
          <sf:Street>One Microsoft Way</sf:Street>
          <sf:SystemModstamp>2015-08-14T18:27:02.000Z</sf:SystemModstamp>
          <sf:Title>Architect</sf:Title>
        </sObject>
      </Notification>
      <Notification>
        <Id>24l37123450L0E5AAK</Id>
        <sObject xsi:type="sf:Lead3" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
          <sf:Id>2123456789ABCDEEAE</sf:Id>
          <sf:City>Redmond</sf:City>
          <sf:CleanStatus>Pending</sf:CleanStatus>
          <sf:Company>Microsoft</sf:Company>
          <sf:Country>USA</sf:Country>
          <sf:CreatedById>1123456789ABCDEAAW</sf:CreatedById>
          <sf:CreatedDate>2015-08-14T18:27:02.000Z</sf:CreatedDate>
          <sf:Description>Some notes...</sf:Description>
          <sf:FirstName>Nora</sf:FirstName>
          <sf:Industry>Technology</sf:Industry>
          <sf:IsConverted>false</sf:IsConverted>
          <sf:IsDeleted>false</sf:IsDeleted>
          <sf:IsUnreadByOwner>false</sf:IsUnreadByOwner>
          <sf:LastModifiedById>1123456789ABCDEAAW</sf:LastModifiedById>
          <sf:LastModifiedDate>2015-08-14T18:27:02.000Z</sf:LastModifiedDate>
          <sf:LastName>Nielsen</sf:LastName>
          <sf:LastReferencedDate>2015-08-14T18:27:02.000Z</sf:LastReferencedDate>
          <sf:LastViewedDate>2015-08-14T18:27:02.000Z</sf:LastViewedDate>
          <sf:LeadSource>Web</sf:LeadSource>
          <sf:OwnerId>1123456789ABCDEAAW</sf:OwnerId>
          <sf:PhotoUrl>/services/images/photo/0123456789ABCDEEAE</sf:PhotoUrl>
          <sf:PostalCode>98052</sf:PostalCode>
          <sf:Salutation>Mr.</sf:Salutation>
          <sf:State>WA</sf:State>
          <sf:Status>Open - Not Contacted</sf:Status>
          <sf:Street>One Microsoft Way</sf:Street>
          <sf:SystemModstamp>2015-08-14T18:27:02.000Z</sf:SystemModstamp>
          <sf:Title>Architect</sf:Title>
        </sObject>
      </Notification>
    </notifications>
  </soapenv:Body>
</soapenv:Envelope>
