spec/fixtures/soap_inbound_update_lead.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
  <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
   <OrganizationId>TEST12345678901234</OrganizationId>
   <ActionId>04k7A0000008OSjQAM</ActionId>
   <SessionId xsi:nil="true"/>
   <EnterpriseUrl>https://cs44.salesforce.com/services/Soap/c/35.0/00D7A0000008ibK</EnterpriseUrl>
   <PartnerUrl>https://cs44.salesforce.com/services/Soap/u/35.0/00D7A0000008ibK</PartnerUrl>
   <Notification>
    <Id>04l7A000000PwkCQAS</Id>
    <sObject xsi:type="sf:Lead" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
     <sf:Id>00Q7A000001CYIAUA4</sf:Id>
     <sf:CYM_Test_Lead__c>false</sf:CYM_Test_Lead__c>
     <sf:Cancelled_Appointment__c>false</sf:Cancelled_Appointment__c>
     <sf:CreatedById>005U0000001uGPKIA2</sf:CreatedById>
     <sf:CreatedDate>2015-12-11T13:18:29.000Z</sf:CreatedDate>
     <sf:Current_Day__c>Friday</sf:Current_Day__c>
     <sf:FirstName>Mark</sf:FirstName>
     <sf:GEM_Candidate__c>false</sf:GEM_Candidate__c>
     <sf:IsConverted>false</sf:IsConverted>
     <sf:IsDeleted>false</sf:IsDeleted>
     <sf:IsUnreadByOwner>true</sf:IsUnreadByOwner>
     <sf:Kept_Appointment__c>false</sf:Kept_Appointment__c>
     <sf:Kit_Purchased__c>false</sf:Kit_Purchased__c>
     <sf:LastModifiedById>005U0000001uGPKIA2</sf:LastModifiedById>
     <sf:LastModifiedDate>2015-12-11T15:08:40.000Z</sf:LastModifiedDate>
     <sf:LastName>Abramov</sf:LastName>
     <sf:LastReferencedDate>2015-12-11T16:30:19.000Z</sf:LastReferencedDate>
     <sf:LastViewedDate>2015-12-11T16:30:19.000Z</sf:LastViewedDate>
     <sf:Lead_Number__c>120847</sf:Lead_Number__c>
     <sf:Merch_App_Date__c>2015-12-11</sf:Merch_App_Date__c>
     <sf:Missed_Appointment__c>false</sf:Missed_Appointment__c>
     <sf:MobilePhone>8-800-555-35-35</sf:MobilePhone>
     <sf:No_ID_Submitted__c>false</sf:No_ID_Submitted__c>
     <sf:OwnerId>005U0000001wJ80IAE</sf:OwnerId>
     <sf:Phone>8-800-555-35-35</sf:Phone>
     <sf:PhoneType__c>Mobile</sf:PhoneType__c>
     <sf:PhotoUrl>/services/images/photo/00Q7A000001CYIAUA4</sf:PhotoUrl>
     <sf:RecordTypeId>012U0000000LxGjIAK</sf:RecordTypeId>
     <sf:Rescheduled_Appointment__c>false</sf:Rescheduled_Appointment__c>
     <sf:Round_Robin_ID__c>13.0</sf:Round_Robin_ID__c>
     <sf:Salutation>Mr.</sf:Salutation>
     <sf:Spanish_preferred__c>false</sf:Spanish_preferred__c>
     <sf:Standard_Outbound_Interview__c>false</sf:Standard_Outbound_Interview__c>
     <sf:Status>New</sf:Status>
     <sf:SystemModstamp>2015-12-11T15:08:40.000Z</sf:SystemModstamp>
     <sf:THE_ENTREPRENEUR__c>false</sf:THE_ENTREPRENEUR__c>
     <sf:THE_FASHIONISTA__c>false</sf:THE_FASHIONISTA__c>
     <sf:THE_SOCIALISTA__c>false</sf:THE_SOCIALISTA__c>
     <sf:THE_TASTEMAKER__c>false</sf:THE_TASTEMAKER__c>
     <sf:TimeTrade__c>Booked</sf:TimeTrade__c>
     <sf:W_9_Submitted__c>false</sf:W_9_Submitted__c>
     <sf:pi__grade__c>5</sf:pi__grade__c>
     <sf:sf4twitter__Fcbk_Picture__c>&lt;a href=&quot; &quot; target=&quot; &quot;&gt; &lt;/a&gt;</sf:sf4twitter__Fcbk_Picture__c>
     <sf:sf4twitter__Follow_Status__c>&lt;a href=&quot;javascript:window.location=&amp;quot;/apex/sf4twitter__TwitterFollow?lid=00Q7A000001CYIA&amp;quot; + ( ( (new RegExp(&amp;quot;[\?&amp;amp;]isdtp=([^&amp;amp;#]*)&amp;quot;)).exec(window.location.href) == null )?&amp;quot;&amp;quot;: &amp;quot;&amp;amp;isdtp=vw&amp;quot;) &quot; target=&quot;_self&quot;&gt;No&lt;/a&gt;</sf:sf4twitter__Follow_Status__c>
     <sf:sf4twitter__Twitter_Picture__c>&lt;a href=&quot;http://twitter.com/&quot; target=&quot; &quot;&gt; &lt;/a&gt;</sf:sf4twitter__Twitter_Picture__c>
     <sf:sf4twitter__followed__c>false</sf:sf4twitter__followed__c>
     <sf:smagicinteract__SMSOptOut__c>false</sf:smagicinteract__SMSOptOut__c>
    </sObject>
   </Notification>
  </notifications>
 </soapenv:Body>
</soapenv:Envelope>
